// 9.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    float A;
    float B;
    float C;
    cout << "4. Даны целые положительные числа A, B, C. На прямоугольнике размера A × B размещено максимально возможное количество квадратов со стороной C (без наложений). Найти количество квадратов, размещенных на прямоугольнике, а также площадь незанятой части прямоугольника. \n";
    cout << "Введите значение стороны А прямоугольника" << "\n";
    cin >> A;
    cout << "Введите значение стороны B прямоугольника" << "\n";
    cin >> B;
    cout << "Введите значение стороны С квадрата" << "\n";
    cin >> C;
    int a = C*floor(A / C);
    int b = C*floor(B / C);
    int S2 = A * B - a * b;
    int co = (a * b) / (C * C);
    cout << "Количество квадратов: " << co << "\n";
    cout << "Площадь незаполненной территории равна: " << S2 << "\n";
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
